In [1]:
print("inteligencia artificial")

inteligencia artificial

In [ ]:
pip install pandas

In [3]:
import pandas as pd

In [4]:
Dicionario ={
    "A":[1,2,3,4],
    "B":[5,6,7,8],
    "C":[9,10,11,12]}
Labels=["1º linha","2º linha","3º linha","4º linha"] # index das colunas

In [5]:
dados = pd.DataFrame(Dicionario,index= Labels)#Cria o dataframe

In [6]:
dados.head() #Mostra seus dados por inteiro

          A  B   C
1º linha  1  5   9
2º linha  2  6  10
3º linha  3  7  11
4º linha  4  8  12

In [7]:
dados.tail(2) #exibe somente as ultimas linhas que vc digitou EX: 2 vai mostrar as ultimas duas linhas do seus dados

          A  B   C
3º linha  3  7  11
4º linha  4  8  12

In [8]:
dados.describe()#Cria um descritivo dos dados

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

In [10]:
dados.info() # descreve informações sobre os dados

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1º linha to 4º linha
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [12]:
dados['D']=dados['B']*dados['C'] #Multiplica as colunas do dados e aloca na coluna D
dados.head()

          A  B   C   D
1º linha  1  5   9  45
2º linha  2  6  10  60
3º linha  3  7  11  77
4º linha  4  8  12  96

In [ ]:
dados.drop('B',axis=1,inplace=True) #exclui coluna B, porem nos dados originais mantem orignal com a coluna B
# o inplace exclue na base de dados original

In [20]:
dados.head()

          A   C   D
1º linha  1   9  45
2º linha  2  10  60
3º linha  3  11  77
4º linha  4  12  96

In [21]:
dados.loc['3º linha'] #Localiza uma linha

A     3
C    11
D    77
Name: 3º linha, dtype: int64

In [25]:
dados.loc[['3º linha','2º linha'],['C','D']] #Busca mais de uma linha e coluna do Dataframe

           C   D
3º linha  11  77
2º linha  10  60

In [28]:
dados.iloc[0:2] # iloc é para exibir linhas a partir do indice posição

          A   C   D
1º linha  1   9  45
2º linha  2  10  60

In [36]:
dados.iloc[0:3,0:2]

          A   C
1º linha  1   9
2º linha  2  10
3º linha  3  11

In [38]:
dados['A'] > 0 # Cria um filtro de dados

1º linha    True
2º linha    True
3º linha    True
4º linha    True
Name: A, dtype: bool

In [51]:
Filtro = dados['A'] > 0 # armazena os resultados na variavel "Filtro"

Filtro

1º linha    True
2º linha    True
3º linha    True
4º linha    True
Name: A, dtype: bool

In [52]:
dados['Filtro']= Filtro # adiciona a coluna Filtro nas colunas

In [54]:
dados.head() # mostra os resultados

          A   C   D  Filtro
1º linha  1   9  45    True
2º linha  2  10  60    True
3º linha  3  11  77    True
4º linha  4  12  96    True

In [65]:
dados[(dados['A']>2)& (dados['C'] >=2)] # filtro na coluna A e C

          A   C   D  Filtro        B
3º linha  3  11  77    True  1,2,3,4
4º linha  4  12  96    True  1,2,3,4

In [67]:
dados.set_index('C') #Alterar o index do Dataframe

    A   D  Filtro
C
9   1  45    True
10  2  60    True
11  3  77    True
12  4  96    True

In [77]:
Dicionario_1={
    'A':[10,20,30,40],
    'B':[50,60,70,80],
    'C':[90,100,110,120],
    'Chaves':['AA','BB','CC','DD']
}

Dicionario_2={
    'A':[5,10,15,20],
    'B':[25,30,35,40],
    'C':[45,50,55,60],
    'Chaves':['AA','BB','CC','DD']
}

Dicionario_3={
    'A':[-5,-10,-15,-20],
    'B':[-25,-30,-35,-40],
    'C':[-45,-50,-55,-60],
    'Chaves':['AA','BB','CC','DD']
}

Labels_01=['1ºlinha','2ºlinha','3ºlinha','4ºlinha']
Labels_02=['5ºlinha','6ºlinha','7ºlinha','8ºlinha']
Labels_03=['9ºlinha','10ºlinha','11ºlinha','12ºlinha']

In [80]:
df1 = pd.DataFrame(Dicionario_1,index=Labels_01)
df2 = pd.DataFrame(Dicionario_2,index=Labels_02)
df3 = pd.DataFrame(Dicionario_3,index=Labels_03)

In [95]:
dados_df = pd.concat([df1,df2,df3]) # junta todos os dataframes desde que tenham a mesma estrutura

In [98]:
dados_df.head(10) # exibe o dataframe unificado

           A   B    C Chaves
1ºlinha   10  50   90     AA
2ºlinha   20  60  100     BB
3ºlinha   30  70  110     CC
4ºlinha   40  80  120     DD
5ºlinha    5  25   45     AA
6ºlinha   10  30   50     BB
7ºlinha   15  35   55     CC
8ºlinha   20  40   60     DD
9ºlinha   -5 -25  -45     AA
10ºlinha -10 -30  -50     BB

In [99]:
df_n = pd.merge(df1,df2, how='inner', on='Chaves') # une o Dataframe a partir da semelhança das chaves nas colunas

In [100]:
df_n.head(10)

   A_x  B_x  C_x Chaves  A_y  B_y  C_y
0   10   50   90     AA    5   25   45
1   20   60  100     BB   10   30   50
2   30   70  110     CC   15   35   55
3   40   80  120     DD   20   40   60

In [93]:
df_n_left = pd.merge(df1,df2, how='left', on='Chaves') # une o Dataframe a partir da semelhança das chaves nas colunas

In [107]:
df_n_left.head()

   A_x  B_x  C_x Chaves  A_y  B_y  C_y
0   10   50   90     AA    5   25   45
1   20   60  100     BB   10   30   50
2   30   70  110     CC   15   35   55
3   40   80  120     DD   20   40   60

In [121]:
Dicionario_1 = {
    "A":[10,20,30,40],
    "B":[50,60,70,80],
    "C":[90,100,110,120],

}

Dicionario_3= {
    "D":[1,2,3,4],
    "E":[5,6,7,8],
    "F":[9,10,11,12],

}

Labels_n=['1ºlinha','2ºlinha','3ºlinha','4ºlinha']

In [122]:
Dataframe1 = pd.DataFrame(Dicionario_1,index=Labels_n)
Dataframe3 = pd.DataFrame(Dicionario_3,index=Labels_n)

In [123]:
Dataframe1.join(Dataframe3) #unifica os Dataframes com base no Labels

          A   B    C  D  E   F
1ºlinha  10  50   90  1  5   9
2ºlinha  20  60  100  2  6  10
3ºlinha  30  70  110  3  7  11
4ºlinha  40  80  120  4  8  12